Catalogs/ИА_Инструкции.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Catalog>
		<Properties>
			<Name>ИА_Инструкции</Name>
			<Comment>Должностные инструкции</Comment>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ТипИнструкции</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ИА_ТипыИнструкций</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаСоздания</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Версия</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОбновления</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Теги</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>300</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Текст</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НаименованиеИнструкции</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Статус</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ИА_СтатусИнструкции</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТекстКолонтитула</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Подписант</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИмяВремКаталогаВорд</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОбновленияГугл</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СсылкаГуглДок</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>КодыРаспределения</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>КодРаспределения</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ОргСхема</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВсемСотрудникам</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Серии</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Серия</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ИА_Серии</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>СписокТегов</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Тег</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ВерсииДокументов</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ДатаСоздания</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Версия</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Файл</Name>
							<Type>
								<v8:Type>v8:ValueStorage</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Вопросы</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Вопрос</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

InformationRegisters/ИА_ФайлыИнструкций.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<InformationRegister>
		<Properties>
			<Name>ИА_ФайлыИнструкций</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Данные</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ИмяФайла</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Инструкция</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ИА_Инструкции</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Enums/ИА_СтатусИнструкции.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Enum>
		<Properties>
			<Name>ИА_СтатусИнструкции</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Проект</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НаСогласовании</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Действует</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НеДействует</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/ИА_РедакторИнструкций.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Enum>
		<Properties>
			<Name>ИА_РедакторИнструкций</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Word</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Writer</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Catalogs/ИА_Инструкции/Forms/ФормаЭлементаУправляемая/Ext/Form/Module.bsl
&НаКлиенте
Процедура УстановитьТекстHTML(ИмяРеквизита, Знач ИсходныйТекст)
		
	#Если ВебКлиент Тогда
		ЭтаФорма[ИмяРеквизита] = ИсходныйТекст;
	#Иначе
		Если Элементы[ИмяРеквизита].Документ <> Неопределено Тогда 
			Элементы[ИмяРеквизита].Документ.open  ("text/html","replace");
			Элементы[ИмяРеквизита].Документ.write (ИсходныйТекст);
			Элементы[ИмяРеквизита].Документ.close ();
		КонецЕсли;
	#КонецЕсли
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	Если не ИА_Защита_Общий.ЛицензияДоступна("ДИ") Тогда
		Отказ = Истина;
		возврат;
	КонецЕсли;
	
    ТекущаяСсылка = Объект.Ссылка;
    
	#Если ВебКлиент Тогда		
		ПодключитьРасширениеРаботыСФайлами();
	#КонецЕсли
	
	Если ТекущаяСсылка.Пустая() Тогда
		Если не ЭтоАдмин  Тогда
			ПоказатьПредупреждение(,"Создавать элементы может только пользователь с уровнем доступа к должностным инструкциям - Администратор!");
			Закрыть();
		КонецЕсли;
		Объект.ДатаСоздания = ТекущаяДата();
	КонецЕсли;
		
	ОбновитьВидимостьДоступность();
	
	ПодключитьОбработчикОжидания("ЗагрузитьПолеHTML_Просмотр",0.1,Истина);
	
	Элементы.СоздатьЗадачиНаОзнакомление.Доступность = ИА_КСУОбщийСервер.РедактированиеКомцентраДоступно();
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьВидимостьДоступность()
	Элементы.ЗагрузитьИзWord.Видимость = не Гугл;
	Элементы.РедактироватьВWord.Видимость = не Гугл;
	Элементы.ФормаОткрыть.Видимость = не Гугл;
	Элементы.ВерсииДокументов.Видимость = не Гугл;
	
	Элементы.ГруппаГуглСсылка.Видимость = Гугл;
	Элементы.История.Видимость = Гугл;
	
	Элементы.ЗагрузитьИзWord.Доступность                        = ЭтоАдмин;
	Элементы.РедактироватьВWord.Доступность                     = ЭтоАдмин;
	Элементы.КнопкаИзменитьСсылку.Доступность                     = ЭтоАдмин;
	Элементы.ГруппаРедактированиеОсновныеДанные.ТолькоПросмотр  = не ЭтоАдмин;	
	Элементы.ГруппаОзнакомление.ТолькоПросмотр                  = не ЭтоАдмин;	
	Элементы.ГруппаВопросы.ТолькоПросмотр                  = не ЭтоАдмин;	
КонецПроцедуры
	
	
&НаКлиенте
Процедура ЗагрузитьПолеHTML_Просмотр()
	УстановитьТекстHTML("ПолеHTML_Просмотр", Объект.Текст);
КонецПроцедуры

&НаСервереБезКонтекста
Процедура СоздатьКопию(пСсылка)
	НовыйОбъект = пСсылка.Скопировать();
	НовыйОбъект.Статус = Перечисления.ИА_СтатусИнструкции.НеДействует;
	НовыйОбъект.Записать();
КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	Перем АдресВременногоХранилища;
	Если не ЭтоАдмин Тогда
		Отказ = Истина;
		Возврат;
	КонецЕсли;	
	
    
     Если БылоИзменениеТекста и (Объект.Статус = ПредопределенноеЗначение("Перечисление.ИА_СтатусИнструкции.Действует"))
		Тогда
		Если Объект.Ссылка.Пустая() Тогда
			Если Объект.Версия = 0 Тогда
				Объект.Версия = 1;
			КонецЕсли;
			Объект.ДатаОбновления = ТекущаяДата();
		Иначе
			//отв = Вопрос("Изменить версию и дату обновления?", РежимДиалогаВопрос.ДаНет);
			//Если отв = КодВозвратаДиалога.Да Тогда
			Объект.Версия = Объект.Версия + 1;
		    ИзменитьВерсию = Истина;
			Объект.ДатаОбновления = ТекущаяДата();
			//КонецЕсли;
		КонецЕсли;
	КонецЕсли;

	Объект.Наименование = Объект.НаименованиеИнструкции + " от " + Формат(Объект.ДатаСоздания,"ДФ=dd.MM.yyyy")+ " ("+"R"+Объект.Версия + ", пересм. " + Формат(Объект.ДатаОбновления,"ДФ=dd.MM.yyyy")+")";
	
	БылоИзменениеТекста = Ложь;	
	
	//Рафаэль - 19.11.14 - проверка заполнения типа инструкции
	Если НЕ ЗначениеЗаполнено(Объект.ТипИнструкции) Тогда
		Сообщить("Не указан тип инструкции!", СтатусСообщения.Внимание);
		Возврат;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
    
    Если ИзменитьВерсию Тогда
        ИзменитьВерсию = ЗаписьФайлаВХранилище(Объект.Ссылка, ТекущийОбъект);
    КонецЕсли;
    
   // Объект.ДатаОбновления = ДатаОбновления;
    
КонецПроцедуры

&НаСервереБезКонтекста
Функция ЗаписьФайлаВХранилище(Ссылка, ТекущийОбъект)	Экспорт
    
    СтрРез = ИА_ОбщиеПроцедуры_Технология_Сервер.ПолучитьДанныеДокФайла(Ссылка);	
	Если НЕ СтрРез = Неопределено Тогда
       
        СтрокаВерсии              = ТекущийОбъект.ВерсииДокументов.Добавить();
		СтрокаВерсии.Версия       = Ссылка.Версия;
		СтрокаВерсии.ДатаСоздания = Ссылка.ДатаОбновления;
		СтрокаВерсии.Файл         = Новый ХранилищеЗначения(СтрРез.Данные);
        
    КонецЕсли;
    
    Возврат Ложь;
    
КонецФункции

&НаКлиенте
Процедура ПолеHTML_ПросмотрДокументСформирован(Элемент)
	Если Элемент.Документ <> Неопределено Тогда
		Элемент.Документ.Body.ContentEditable = "false";
		Элемент.Документ.body.scroll = "auto";
	Иначе
		ПодключитьОбработчикОжидания("ЗагрузитьПолеHTML_Просмотр",0.1,Истина);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура Печать(Команда)
	//ф = ПолучитьФорму("ОбщаяФорма.ИА_ПечатьДолжностнойИнструкцииУправляемая");
	//
	//ЭтоАдмин = ИА_ОбщиеПроцедуры_Технология.ИА_ОбъектДоступен(ПредопределенноеЗначение("Справочник.ОргСхема.ПустаяСсылка"));
	//Если ЭтоАдмин Тогда
	//	ф.Текст = ПолучитьТекстHTML("ПолеHTML_Редактирование");
	//	
	//Иначе
	//	ф.Текст = Объект.Текст;
	//КонецЕсли;
	//
	//ф.Инструкция = Объект.Ссылка;
	//ф.Открыть();
КонецПроцедуры

&НаСервереБезКонтекста
Функция ТекущийПользователь()
	Возврат ПараметрыСеанса.ТекущийПользователь;
КонецФункции

&НаКлиенте
Процедура ЗагрузитьИзWord(Команда)
	редактор = ИА_ОбщиеПроцедуры_Технология_Сервер.ПолучитьРедакторИнструкций();
	Если редактор = ПредопределенноеЗначение("Перечисление.ИА_РедакторИнструкций.ПустаяСсылка") Тогда
		ПоказатьПредупреждение(,"На Вашем компьютере не установлен MS Office или OpenOffice. Для корректной работы необходимо установить один из этих продуктов!");
		Возврат;
	КонецЕсли;
	
	#Если ВебКлиент Тогда
		ПолноеИмяФайла = "";
		НачатьПомещениеФайла(Новый ОписаниеОповещения("ЗагрузитьИзWordЗавершение", ЭтотОбъект, Новый Структура("редактор", редактор)),  , , Истина);
        Возврат;
	#Иначе
		Режим = РежимДиалогаВыбораФайла.Открытие;
		ДиалогОткрытияФайла = Новый ДиалогВыбораФайла(Режим);
		ДиалогОткрытияФайла.ПолноеИмяФайла = "";
		Фильтр = "MS Word(*.doc*)|*.doc*|OpenOffice Writer(*.odt)|*.odt";
		ДиалогОткрытияФайла.Фильтр = Фильтр;
		ДиалогОткрытияФайла.МножественныйВыбор = Ложь;
		ДиалогОткрытияФайла.Заголовок = "Выберите файл с инструкцией";
		Если Не ДиалогОткрытияФайла.Выбрать() Тогда
			Возврат;	
		КонецЕсли;
		
		ПолноеИмяФайла = ДиалогОткрытияФайла.ПолноеИмяФайла;
	#КонецЕсли	
	
	ЗагрузитьИзWordФрагмент(ПолноеИмяФайла, редактор);
КонецПроцедуры

&НаКлиенте
Процедура ЗагрузитьИзWordЗавершение(Результат, Адрес, ПолноеИмяФайла, ДополнительныеПараметры) Экспорт
	
	Если Не Результат Тогда
		Возврат;
	КонецЕсли;
	
	ЗагрузитьИзWordФрагмент(ПолноеИмяФайла, ДополнительныеПараметры.редактор);

КонецПроцедуры

&НаКлиенте
Процедура ЗагрузитьИзWordФрагмент(ПолноеИмяФайла, Знач редактор)
	
	Файл = Новый Файл(ПолноеИмяФайла);
	ИмяФайла = Файл.Имя;
	
	ОпОп = Новый ОписаниеОповещения("ЗагрузитьИзWordФрагментЗавершение", ЭтотОбъект,Новый Структура("ИмяФайла,редактор",ИмяФайла,редактор));
	НачатьСозданиеДвоичныхДанныхИзФайла(ОпОп, ПолноеИмяФайла) ;
КонецПроцедуры

&НаКлиенте
Процедура ЗагрузитьИзWordФрагментЗавершение(ДДИсхДок, дп) Экспорт	
	ЗагрузитьИзWordСервер(дп.ИмяФайла, дп.редактор, ДДИсхДок);
	УстановитьТекстHTML("ПолеHTML_Просмотр",Объект.Текст);
КонецПроцедуры

&НаСервере
Процедура ЗагрузитьИзWordСервер(ИмяФайлаИсх, редактор, ДДИсхДок)
	Если ИА_ДИ_ИспользоватьGoogleДокументыДляКонвертации Тогда
		РезХТМЛ = ИА_Защита_ДИ.ПолучитьХТМЛЧерезGoogle(ДДИсхДок,ИмяФайлаИсх);
		Если РезХТМЛ <> Неопределено Тогда
			Объект.Текст = РезХТМЛ;

			ДокФайл = Base64Строка(ДДИсхДок);		
			Модифицированность = Истина;
			БылоИзменениеТекста = истина;
		КонецЕсли;
		возврат;
	КонецЕсли;
	
	
	ЕстьВорд = редактор = Перечисления.ИА_РедакторИнструкций.Word;
	ЕстьВрайтер = редактор = Перечисления.ИА_РедакторИнструкций.Writer;
	
	Если ЕстьВорд Тогда
		Word = новый COMОбъект("Word.Application");
	иначе
		Word = новый COMОбъект("com.sun.star.ServiceManager");
	КонецЕсли;	
	
	
	//---------------------------------------
	
	ВременныйКаталог = КаталогВременныхФайлов()+Строка(Новый УникальныйИдентификатор);	
	СоздатьКаталог(ВременныйКаталог);
	
	ПолноеИмяФайла = ВременныйКаталог+"\"+ИмяФайлаИсх;
	ДДИсхДок.Записать(ПолноеИмяФайла);
	
	Файл = Новый Файл(ПолноеИмяФайла);
	ИмяФайла = Файл.Имя;
	
	// сконвертируем в ХТМЛ
	
	Если ЕстьВорд Тогда
		Попытка 
			Word.Documents.Add(ПолноеИмяФайла);
		Исключение
			Сообщить("Не могу открыть файл "+ПолноеИмяФайла);
			Возврат;
		КонецПопытки;
		
		Document=Word.ActiveDocument;
		
		wdFormatHTML = 8;
		wdFormatWebArchive = 9;
		wdFormatFilteredHTML = 10;
		
		Попытка // убираем комменты
			Document.DeleteAllComments();
			Document.DeleteAllInkAnnotations();
			Document.SaveAs(ВременныйКаталог+"\data.doc");
			Document.Close();
			Word.Quit();
			Word = 0;
			
			//////////////////////////////////
			
			Word = новый COMОбъект("Word.Application");
			Word.Documents.Add(ВременныйКаталог+"\data.doc");
			Document=Word.ActiveDocument;
		Исключение
		КонецПопытки;
		
		
		Document.SaveAs(ВременныйКаталог+"\data.html", wdFormatFilteredHTML);
		Document.Close();
		Word.Quit();
		Word = 0;
		
		// сформируем структуру файлов и отдадим на сервер
		Файлы = Новый Соответствие;
		МассивФайлов = НайтиФайлы(ВременныйКаталог+"\","*",Истина);
		
		Для Каждого Файл из МассивФайлов Цикл
			Если не Файл.Этокаталог() Тогда
				ДанныеФайла = Новый ДвоичныеДанные(Файл.ПолноеИмя);
				Файлы.Вставить(Файл.Имя, ДанныеФайла);
			КонецЕсли;
		КонецЦикла;
		Объект.Текст = ИА_Защита_ДИ.СформироватьНТМЛДокументИзВордНаСервере(Файлы, ЕстьВорд);
		//УстановитьТекстHTML("ПолеHTML_Просмотр",Объект.Текст);
	Иначе
		//если это DOCX пересохраним в DOC т.к. ОО не умеет сохранять в DOCX
		Если НРЕГ(прав(ПолноеИмяФайла,4)) = "docx" Тогда
			Desktop = Word.createInstance("com.sun.star.frame.Desktop");
			
			Args = Новый COMSafeArray("VT_VARIANT", 1);
			lProp1       = Word.Bridge_GetStruct("com.sun.star.beans.PropertyValue"); 
			lProp1.Name  = "Hidden"; 
			lProp1.Value = true; 
			Args.SetValue(0, lProp1);
			
			Документ = Desktop.LoadComponentFromURL("file:///"+ПолноеИмяФайла, "_hidden", 0, Args);
			
			lProperties = Новый COMSafeArray("VT_VARIANT", 1);		
			lProp       = Word.Bridge_GetStruct("com.sun.star.beans.PropertyValue"); 
			lProp.Name  = "FilterName"; 
			lProp.Value = "MS Word 97"; 
			lProperties.SetValue(0, lProp);
			
			ПолноеИмяФайла = ВременныйКаталог+"\data.doc";
			Путь = СтрЗаменить(ПолноеИмяФайла, "\", "/");
			Документ.storeToURL("file:///" + Путь, lProperties);
			Документ.Close(Истина);
			//
			ИмяФайла = "data.doc";
			//
			Документ = 0;
			Args = 0;
			lProperties = 0;
			lProp = 0;
			Desktop = 0;
			Word = 0;
		КонецЕсли;
		
		ДанныеФайла = Новый ДвоичныеДанные(ПолноеИмяФайла);
		РезХТМЛ = ИА_Защита_ДИ.ПолучитьХТМЛЧерезВеб(ДанныеФайла, ИмяФайла);
		Если ЛЕВ(РезХТМЛ,6) = "ОШИБКА" Тогда
			ИмяФайла = "";
			Сообщить(РезХТМЛ);
			Возврат;
		Иначе
			Объект.Текст = РезХТМЛ;
			//УстановитьТекстHTML("ПолеHTML_Просмотр",Объект.Текст);
		КонецЕсли;
	КонецЕсли;
	
	// сохраним док файл
	ДвДанныеФайла = Новый ДвоичныеДанные(ПолноеИмяФайла);
	ДокФайл = Base64Строка(ДвДанныеФайла);
	
	УдалитьФайлы(ВременныйКаталог);
	
	Модифицированность = Истина;
	БылоИзменениеТекста = истина;

КонецПроцедуры


&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Гугл = Константы.ИА_ДИ_ИспользоватьGoogleДокументы.Получить();
	ИА_ДИ_ИспользоватьGoogleДокументыДляКонвертации = Константы.ИА_ДИ_ИспользоватьGoogleДокументыДляКонвертации.Получить();
	ЭтоАдмин = ИА_ОбщиеПроцедуры_Технология_Сервер.ИА_ОбъектДоступен(ПредопределенноеЗначение("Справочник.ОргСхема.ПустаяСсылка"));
	УстановитьОтборЗадач();
	
	Если Гугл и Объект.СсылкаГуглДок <> "" Тогда
		ОбновитьИсторию();
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ОбновитьИсторию()
	Попытка 
		датыИзм = ИА_Инструкции.ПолучитьДатыИзменений(Объект.СсылкаГуглДок);
		Для каждого датаИзм из датыИзм Цикл
			Новстр = История.Добавить();
			ЗаполнитьЗначенияСвойств(новстр, датаИзм);
		КонецЦикла;
	Исключение
		Сообщить(ОписаниеОшибки());
	КонецПопытки;
КонецПроцедуры

&НаСервере
Функция УстановитьОтборЗадач()
	
	ЭлементыОтбора = ЗадачиОзнакомления.Отбор.Элементы;
	ЭлементыОтбора.Очистить();
	ИА_КСУОбщийСервер.ДобавитьЭлементОтбора(ЭлементыОтбора, "Инструкция",ВидСравненияКомпоновкиДанных.Равно, Объект.Ссылка, Истина);
	
КонецФункции

&НаКлиенте
Процедура СоздатьЗадачиНаОзнакомление(Команда)
	
	Записать();
	ОбновитьСписокЗадач = Ложь;
	
	ЗаголовокЗадачи = "Ознакомиться с должностной инструкцией";
	СрокИсполнения = НачалоДня(ТекущаяДата() + 7*60*60*24); //дается неделя

	СтрукПараметров = Новый Структура;
	СтрукПараметров.Вставить("Инструкция",Объект.Ссылка);
	СтрукПараметров.Вставить("ЗаголовокЗадачи",ЗаголовокЗадачи);
	СтрукПараметров.Вставить("СрокИсполнения",СрокИсполнения);
	
	Оповещение = Новый ОписаниеОповещения("ВводПользователейЗавершение", ЭтаФорма, СтрукПараметров);
	ОткрытьФорму("Справочник.ИА_Инструкции.Форма.СписокСотрудников",СтрукПараметров,,,,,Оповещение);

КонецПроцедуры

&НаСервере
Процедура СоздатьЗадачиОзнакомление(рез, заголовокЗадачи, СрокИсполнения)
	Для Каждого Стр Из Рез Цикл
		НоваяЗадача = Задачи.ИА_ЗадачаПланаДействий.СоздатьЗадачу();
		НоваяЗадача.Автор = ПараметрыСеанса.ТекущийПользователь;
		НоваяЗадача.ПостАвтора = ИА_ОбщиеПроцедуры_Технология_КоммЦентр.ПолучитьВысокийПостПользователя(НоваяЗадача.Автор);
		НоваяЗадача.Дата = ТекущаяДата();
		НоваяЗадача.Наименование = заголовокЗадачи;
		НоваяЗадача.Содержание = Объект.Наименование + ". Задание находится в прикрепленном объекте.";
		НоваяЗадача.Пользователь = Стр.Значение;
		
		СписокДИ = новый массив;
		СписокДИ.Добавить(Объект.Ссылка);
		задание = ИА_ОбщиеПроцедуры_Технология_Сервер.ПолучитьЗадачуНаОзнакомление(НоваяЗадача.Пользователь,СписокДИ, СрокИсполнения);
		НоваяЗадача.ПрикрепленныйОбъект = задание;
		//НоваяЗадача.ПрикрепленныйОбъект = Объект.Ссылка;
		НоваяЗадача.Отправлена = истина;
		Если Не СрокИсполнения = Дата(1,1,1) тогда
			НоваяЗадача.СрокИсполнения = СрокИсполнения;
		КонецЕсли;
		НоваяЗадача.Записать();
	КонецЦикла;
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьСписокИнструкций()
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ИА_Инструкции.Ссылка,
	               |	ИА_Инструкции.Наименование КАК Наименование
	               |ИЗ
	               |	Справочник.ИА_Инструкции КАК ИА_Инструкции
	               |ГДЕ
	               |	ИА_Инструкции.ЭтоГруппа = ложь
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	Наименование";
	Выборка = Запрос.Выполнить().Выбрать();
	
	рез = Новый Массив;
	Пока Выборка.Следующий() Цикл
		рез.Добавить(Выборка.Наименование+"|^|"+"1CRefInst"+Выборка.Ссылка.УникальныйИдентификатор());
	КонецЦикла;
	Возврат Рез;
КонецФункции

&НаКлиенте
Процедура РедактироватьВWord(Команда)
    
    редактор = ИА_ОбщиеПроцедуры_Технология_Сервер.ПолучитьРедакторИнструкций();
    Если редактор = ПредопределенноеЗначение("Перечисление.ИА_РедакторИнструкций.ПустаяСсылка") Тогда
    	ПоказатьПредупреждение(,"На Вашем компьютере не установлен MS Office или OpenOffice. Для корректной работы необходимо установить один из этих продуктов!");
    	Возврат;
    КонецЕсли;
    
    ЕстьВорд = редактор = ПредопределенноеЗначение("Перечисление.ИА_РедакторИнструкций.Word");
    
    ВременныйКаталог = КаталогВременныхФайлов()+Строка(Новый УникальныйИдентификатор)+ "\";
    СоздатьКаталог(ВременныйКаталог);
    
    //ворд файл
    Если ДокФайл = "" Тогда
    	СтрРез = ИА_ОбщиеПроцедуры_Технология_Сервер.ПолучитьДанныеДокФайла(Объект.Ссылка);
    	Если СтрРез = Неопределено Тогда
			Если ЗначениеЗаполнено(Объект.ТипИнструкции) Тогда                       
                ДанныеДокФайла = ПолучитьШаблонДИПоТипу(Объект.ТипИнструкции);
                Если ДанныеДокФайла = Неопределено тогда
                    ДанныеДокФайла = ПолучитьШаблонДИ();
                    Если ДанныеДокФайла = Неопределено тогда
                        Сообщить("Укажите константу ""Шаблон интрукций""!");
                        Возврат;
                    КонецЕсли; 
                КонецЕсли;                  
            Иначе
                ДанныеДокФайла = ПолучитьШаблонДИ();
                Если ДанныеДокФайла = Неопределено тогда
                    Сообщить("Укажите константу ""Шаблон интрукций""!");
                    Возврат;
                КонецЕсли;
            КонецЕсли;
            ИмяФайла = "instruction.doc";
    	Иначе
    		ДанныеДокФайла = СтрРез.Данные; 
    		ИмяФайла = СтрРез.Имя;
    	КонецЕсли;
	Иначе
		//ИмяФайла = "instruction.doc";
    	ДанныеДокФайла = Base64Значение(ДокФайл);
    КонецЕсли;
    
    ПолныйПутьДокФайл = ВременныйКаталог + ИмяФайла; 
	ОпОп = Новый ОписаниеОповещения("ЗаписьДокЗавершение", ЭтотОбъект, Новый Структура("ВременныйКаталог,ЕстьВорд,ПолныйПутьДокФайл",ВременныйКаталог,ЕстьВорд,ПолныйПутьДокФайл));
    ДанныеДокФайла.НачатьЗапись(ОпОп,ПолныйПутьДокФайл);
    // /ворд
КонецПроцедуры

&НаКлиенте
Процедура ЗаписьДокЗавершение(дп) Экспорт
    
    ИА_ОбщиеПроцедуры_Технология.ОткрытьДокФайл(дп.ПолныйПутьДокФайл);
    
    ПоказатьВопрос(Новый ОписаниеОповещения("РедактироватьВWordЗавершение", ЭтотОбъект, Новый Структура("ВременныйКаталог, ЕстьВорд, ПолныйПутьДокФайл", дп.ВременныйКаталог, дп.ЕстьВорд, дп.ПолныйПутьДокФайл)), "Когда закончите редактирование и закроете редактор, нажмите ОК для принятия изменений или Отмена, для отказа от изменений.", РежимДиалогаВопрос.ОКОтмена);
КонецПроцедуры


&НаСервере
Функция СохранитьВХТМЛ(ДДИсхФ,ИмяИсхФ)
	ВременныйКаталог = КаталогВременныхФайлов()+Строка(Новый УникальныйИдентификатор);	
	СоздатьКаталог(ВременныйКаталог);
	ПолныйПутьДокФайл = ВременныйКаталог+"\"+ИмяИсхФ;
	
	ДДИсхФ.Записать(ПолныйПутьДокФайл);
	
	Word = новый COMОбъект("Word.Application");
	Попытка 
		Word.Documents.Add(ПолныйПутьДокФайл);
	Исключение
		Сообщить("Не могу открыть файл "+ПолныйПутьДокФайл);
		Возврат Неопределено;
	КонецПопытки;
	
	Document=Word.ActiveDocument;
	
	wdFormatHTML = 8;
	wdFormatWebArchive = 9;
	wdFormatFilteredHTML = 10;
	Document.SaveAs(ВременныйКаталог+"\"+"data.html", wdFormatFilteredHTML);
	Document.Close(0);
	
	Word.Quit();
	Word = 0;
	
	//рез = новый ДвоичныеДанные(ВременныйКаталог+"data.html");
	
	
	//
	//ДД_резХТМЛ.Записать(ВременныйКаталог+"data.html");
				
	Файлы = Новый Соответствие;
	МассивФайлов = НайтиФайлы(ВременныйКаталог,"*",Истина);
	
	Для Каждого Файл из МассивФайлов Цикл
		Если не Файл.Этокаталог() Тогда
			ДанныеФайла = Новый ДвоичныеДанные(Файл.ПолноеИмя);
			Файлы.Вставить(Файл.Имя, ДанныеФайла);
		КонецЕсли;
	КонецЦикла;

	Попытка
		УдалитьФайлы(ВременныйКаталог);
	Исключение
	КонецПопытки;
	
	возврат файлы; 
КонецФункции

&НаКлиенте
Процедура ПрочитатьДокФайлДДЗавершение(ДанныеФайла, ДополнительныеПараметры) Экспорт
	
	ВременныйКаталог = ДополнительныеПараметры.ВременныйКаталог;
	ЕстьВорд = ДополнительныеПараметры.ЕстьВорд;
	ПолныйПутьДокФайл = ДополнительныеПараметры.ПолныйПутьДокФайл;
	
	Если ИА_ДИ_ИспользоватьGoogleДокументыДляКонвертации Тогда
		врИмя = ИмяФайла;
		РезХТМЛ = ИА_Защита_ДИ.ПолучитьХТМЛЧерезGoogle(ДанныеФайла, врИмя);
	
		Если РезХТМЛ <> Неопределено Тогда
			Объект.Текст = РезХТМЛ;
			УстановитьТекстHTML("ПолеHTML_Просмотр",Объект.Текст);

			ДокФайл = Base64Строка(ДанныеФайла);		
			Модифицированность = Истина;
			БылоИзменениеТекста = истина;
		КонецЕсли;
		возврат;
	КонецЕсли;

	
	
	//Пересохраним в HTML. Обработаем прикрепленные изображения
	Если ЕстьВорд Тогда
		
		ИсхФ = Новый Файл(ПолныйПутьДокФайл);
		ИмяИсхФ = ИсхФ.Имя;
		
		Файлы = СохранитьВХТМЛ(ДанныеФайла,ИмяИсхФ);
		
		Если Файлы = Неопределено Тогда
			возврат;
		КонецЕсли;
							
		Объект.Текст = ИА_Защита_ДИ.СформироватьНТМЛДокументИзВордНаСервере(Файлы, ЕстьВорд);
		УстановитьТекстHTML("ПолеHTML_Просмотр",Объект.Текст);			
		
	иначе
		РезХТМЛ = ИА_Защита_ДИ.ПолучитьХТМЛЧерезВеб(ДанныеФайла, ИмяФайла);
		Если ЛЕВ(РезХТМЛ,6) = "ОШИБКА" Тогда
			Сообщить(РезХТМЛ);
			Возврат;
		Иначе
			Объект.Текст = РезХТМЛ;
			УстановитьТекстHTML("ПолеHTML_Просмотр",Объект.Текст);
		КонецЕсли;
	КонецЕсли;
	
	ДокФайл = Base64Строка(ДанныеФайла);
	
	// Сохранение результата
	Модифицированность = Истина;
	БылоИзменениеТекста = истина;
	
	Попытка
		УдалитьФайлы(ВременныйКаталог);
	Исключение
	КонецПопытки;
КонецПроцедуры

&НаКлиенте
Процедура РедактироватьВWordЗавершение(РезультатВопроса, ДополнительныеПараметры) Экспорт
	
	ВременныйКаталог = ДополнительныеПараметры.ВременныйКаталог;
	ЕстьВорд = ДополнительныеПараметры.ЕстьВорд;
	ПолныйПутьДокФайл = ДополнительныеПараметры.ПолныйПутьДокФайл;
	
	
	Если РезультатВопроса=КодВозвратаДиалога.ОК Тогда
		
		ОпОп = Новый ОписаниеОповещения("ПрочитатьДокФайлДДЗавершение",ЭтотОбъект,ДополнительныеПараметры);
		НачатьСозданиеДвоичныхДанныхИзФайла(ОпОп, ПолныйПутьДокФайл);
	Иначе
		Попытка
			УдалитьФайлы(ВременныйКаталог);
		Исключение
		КонецПопытки;
	КонецЕсли;

КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьШаблонДИ()
	Возврат Константы.ИА_ДИ_Шаблон.Получить().Получить();
КонецФункции

&НаСервереБезКонтекста
Функция ПолучитьШаблонДИПоТипу(Ссылка)
    
    ТипИнструкции = Ссылка.ПолучитьОбъект();	
    Возврат ТипИнструкции.Шаблон.Получить();
    
КонецФункции

&НаСервере
Процедура СоздатьМакрос(ЕстьВорд, ВременныйКаталог)
	Если ЕстьВорд Тогда
		Wsh = Новый COMОбъект("WScript.Shell");
	    Wsh.RegWrite("HKEY_CURRENT_USER\SOFTWARE\Microsoft\Office\10.0\Word\Security\AccessVBOM", 1, "REG_DWORD");
	    Wsh.RegWrite("HKEY_CURRENT_USER\SOFTWARE\Microsoft\Office\11.0\Word\Security\AccessVBOM", 1, "REG_DWORD");
		Wsh.RegWrite("HKEY_CURRENT_USER\SOFTWARE\Microsoft\Office\12.0\Word\Security\AccessVBOM", 1, "REG_DWORD");
		Wsh.RegWrite("HKEY_CURRENT_USER\SOFTWARE\Microsoft\Office\13.0\Word\Security\AccessVBOM", 1, "REG_DWORD");
		Wsh.RegWrite("HKEY_CURRENT_USER\SOFTWARE\Microsoft\Office\14.0\Word\Security\AccessVBOM", 1, "REG_DWORD");
		Wsh.RegWrite("HKEY_CURRENT_USER\SOFTWARE\Microsoft\Office\15.0\Word\Security\AccessVBOM", 1, "REG_DWORD");
		Wsh.RegWrite("HKEY_CURRENT_USER\SOFTWARE\Microsoft\Office\16.0\Word\Security\AccessVBOM", 1, "REG_DWORD");
		Wsh.RegWrite("HKEY_CURRENT_USER\SOFTWARE\Microsoft\Office\17.0\Word\Security\AccessVBOM", 1, "REG_DWORD");
		Wsh.RegWrite("HKEY_CURRENT_USER\SOFTWARE\Microsoft\Office\18.0\Word\Security\AccessVBOM", 1, "REG_DWORD");
		Wsh.RegWrite("HKEY_CURRENT_USER\SOFTWARE\Microsoft\Office\19.0\Word\Security\AccessVBOM", 1, "REG_DWORD");
		Wsh.RegWrite("HKEY_CURRENT_USER\SOFTWARE\Microsoft\Office\20.0\Word\Security\AccessVBOM", 1, "REG_DWORD");
	    Wsh = "";
		
		Word = новый COMОбъект("Word.Application");
		WordDoc = Word.Documents.Add();
		
		// проверим на существование макроса
		Для каждого проект из Word.VBE.VBProjects Цикл
			для каждого макрос из проект.VBComponents Цикл
				Если макрос.Name = "AddLinkToInstruction" Тогда
					WordDoc.Close();
					Word.Quit();
					WordDoc = 0;
					Word = 0;
					Возврат;
				КонецЕсли;
			КонецЦикла;
		КонецЦикла;
		
		// создадим макрос
		strCode = ПолучитьТекстМакроса(Истина);
		module = Word.VBE.VBProjects("Normal").VBComponents.Add(1);
		module.CodeModule.AddFromString(strCode);
		module.Name = "AddLinkToInstruction";
		
		// создадим форму
		//   извлечение
		Архив = ПолучитьФормуМакроса();
		Архив.Записать(ВременныйКаталог+"form.zip");
		ЧтениеАхива = Новый ЧтениеZipФайла(ВременныйКаталог+"form.zip");
		ЧтениеАхива.ИзвлечьВсе(ВременныйКаталог);
		//   создание формы
		form = Word.VBE.VBProjects("Normal").VBComponents.Import(ВременныйКаталог + "Instructions_ksu.frm");
	   
	   	WordDoc.Close();
		Word.Quit();
		WordDoc = 0;
		Word = 0;
	Иначе
		Word = новый COMОбъект("com.sun.star.ServiceManager");
		
		Container = Word.createInstance("com.sun.star.script.ApplicationDialogLibraryContainer");
		Если Container.hasByName("KSU") Тогда
			Word = 0;
			Container = 0;
			Возврат;
		КонецЕсли;
		
		// создадим библиотеку
		Архив = ПолучитьБиблиотекуОО(); 
		
		Попытка // возможно 8.2
			Выполнить("катБибл =  КаталогДокументов();");
		Исключение
			Shell = Новый COMОбъект("WScript.Shell");
			катБибл = Shell.SpecialFolders.Item("MyDocuments")+"\";
		КонецПопытки;
		
		катБибл = катБибл +"KSU\OO_bibl\";
		СоздатьКаталог(катБибл);
		
		Архив.Записать(катБибл+"bibl.zip");
		ЧтениеАхива = Новый ЧтениеZipФайла(катБибл+"bibl.zip");
		ЧтениеАхива.ИзвлечьВсе(катБибл);
		
		Container.CreateLibraryLink("KSU", ИА_ОбщиеПроцедуры_Технология_Сервер.convertToURL(катБибл + "KSU"), False);
	   	Container.LoadLibrary("KSU");
		
		// загрузим макрос
		Word = новый COMОбъект("com.sun.star.ServiceManager");
		KSU_Lib = Word.createInstance("com.sun.star.script.ApplicationScriptLibraryContainer").GetByName("Standard");
		Если KSU_Lib.hasByName("KSU") Тогда
			Word = 0;
			KSU_Lib = 0;
			Возврат;
		КонецЕсли;
		
		ТекстМодуля = ПолучитьТекстМакроса(ложь);
		KSU_Lib.InsertByName("KSU", ТекстМодуля);
		
		Word = 0;
		Container = 0;
		KSU_Lib = 0;
	КонецЕсли;
КонецПроцедуры

&наСервереБезКонтекста
Функция ПолучитьТекстМакроса(ЕстьВорд)
	Если ЕстьВорд тогда
		Возврат ПолучитьОбщийМакет("КСУ_Макрос_Word").ПолучитьТекст();
	Иначе
		Возврат ПолучитьОбщийМакет("КСУ_Макрос_OpenOffice").ПолучитьТекст();
	КонецЕсли;
КонецФункции

&наСервереБезКонтекста
Функция ПолучитьФормуМакроса()
	Возврат ПолучитьОбщийМакет("КСУ_Форма_Word");
КонецФункции

&НаСервереБезКонтекста
Функция ПолучитьБиблиотекуОО()
	Возврат ПолучитьОбщийМакет("КСУ_Библиотека_OpenOffice");
КонецФункции

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	Если ДокФайл<>"" Тогда
		Мен = РегистрыСведений.ИА_ФайлыИнструкций.СоздатьМенеджерЗаписи();
		Мен.Инструкция = ТекущийОбъект.Ссылка;
		Мен.Данные = Новый ХранилищеЗначения(Base64Значение(ДокФайл));
		Мен.ИмяФайла = ИмяФайла;
		Мен.Записать(Истина);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПолеHTML_ПросмотрПриНажатии(Элемент, ДанныеСобытия, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьВВорде(Команда)
	ИА_ОбщиеПроцедуры_Технология.ОткрытьВВорде(Объект.Ссылка, Объект.Подписант, ДокФайл);
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьДС(Команда)
    Элементы.ЗадачиОзнакомления.Обновить();
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	Оповестить("ИА_Инструкции_Изменен");
КонецПроцедуры

&НаСервере
Функция ЗаписатьФайлВКаталогВременныхФайлов(Версия)	
	ТекДок = РеквизитФормыВЗначение("Объект");
	ВерсииДокументов = ТекДок.ВерсииДокументов;
	СтрокаВерсии = ВерсииДокументов.Найти(Версия,"Версия");
	ДанныеДокФайла = СтрокаВерсии.Файл.Получить(); 
	Возврат ДанныеДокФайла;
КонецФункции

&НаКлиенте
Процедура ОткрытьВерсию(Команда)
	тд = Элементы.ВерсииДокументов.ТекущиеДанные;
	Если НЕ тд = Неопределено Тогда
		ДанныеДокФайла = ЗаписатьФайлВКаталогВременныхФайлов(тд.Версия);
		ВрКат = КаталогВременныхФайлов();
		ИмяФайла = "instruction_history.doc";
		ПолныйПутьДокФайл = ВрКат + ИмяФайла; 
		
		ОпОп = Новый ОписаниеОповещения("ОткрытьВерсиюЗавершение", ЭтотОбъект, новый Структура("ПолныйПутьДокФайл",ПолныйПутьДокФайл));
		ДанныеДокФайла.НачатьЗапись(ОпОп,ПолныйПутьДокФайл);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьВерсиюЗавершение(дп) Экспорт	
	ИА_ОбщиеПроцедуры_Технология.ОткрытьДокФайл(дп.ПолныйПутьДокФайл)
КонецПроцедуры

&НаКлиенте 
Процедура ВводПользователейЗавершение(Результат, ДополнительныеПараметры) Экспорт 
	Если НЕ Результат = Неопределено Тогда 
		
		ДополнительныеПараметры.Вставить("СписокПользователей",Результат);
		Оповещение = Новый ОписаниеОповещения("ВводЗаголовкаЗадачиЗавершение", ЭтаФорма, ДополнительныеПараметры); 
		ПоказатьВводСтроки(Оповещение, ДополнительныеПараметры.ЗаголовокЗадачи, "Введите заголовок задачи", 150);
		
	КонецЕсли;
КонецПроцедуры

&НаКлиенте 
Процедура ВводЗаголовкаЗадачиЗавершение(Результат, ДополнительныеПараметры) Экспорт 
	Если НЕ Результат = Неопределено Тогда 
		
		ДополнительныеПараметры.Вставить("ЗаголовокЗадачи",Результат);
		Оповещение = Новый ОписаниеОповещения("ВводСрокаИсполненияЗадачи", ЭтаФорма, ДополнительныеПараметры); 
		ПоказатьВводДаты(Оповещение, ДополнительныеПараметры.СрокИсполнения, "Введите срок исполнения задачи", ЧастиДаты.Дата);
		
	КонецЕсли;
КонецПроцедуры

&НаКлиенте 
Процедура ВводСрокаИсполненияЗадачи(Результат, ДополнительныеПараметры) Экспорт 
	Если НЕ Результат = Неопределено Тогда 
		
		ДополнительныеПараметры.Вставить("СрокИсполнения",Результат);
		
		ОбновитьСписокЗадач = Истина;
		Если ДополнительныеПараметры.СрокИсполнения < ТекущаяДата()+1800 Тогда
			
			ОбновитьСписокЗадач  = ложь;
			ПоказатьПредупреждение(,"Дата текущего срока исполнения не может быть меньше текущей времени!");
			
			Возврат;  
			
		КонецЕсли;
		СоздатьЗадачиОзнакомление(ДополнительныеПараметры.СписокПользователей, 
								  ДополнительныеПараметры.ЗаголовокЗадачи, 
								  ДополнительныеПараметры.СрокИсполнения);
		
		Если ОбновитьСписокЗадач Тогда	
			УстановитьОтборЗадач(); 
			Элементы.ЗадачиОзнакомления.Обновить();
		КонецЕсли;
		
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура СсылкаГуглДокНажатие(Элемент, СтандартнаяОбработка)
	СтандартнаяОбработка = ложь;
	ЗапуститьПриложение(Объект.СсылкаГуглДок);
КонецПроцедуры

&НаКлиенте
Процедура ИзменитьСсылку(Команда)
	Подсказка = "Введите ссылку на Google документ";
	Оповещение = Новый ОписаниеОповещения("ПослеВводаСсылки",ЭтотОбъект, Параметры);
	ПоказатьВводСтроки(Оповещение, "", Подсказка, 0, ложь);
КонецПроцедуры

&НаКлиенте
Процедура ПослеВводаСсылки(Строка, Параметры) Экспорт
	Если Строка <> Неопределено Тогда
		Объект.СсылкаГуглДок = Строка;
		
		ОбновитьГуглДок();
    КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьГуглДок() 
	Объект.Текст = ИА_Инструкции.ПолучитьТекстИнструкцииГугл(Объект.СсылкаГуглДок);
	Объект.ДатаОбновленияГугл = УниверсальноеВремя(ТекущаяДата());	
	ПолеHTML_Просмотр = Объект.Текст;
	Модифицированность = истина;
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьИзGoogle(Команда)
	Если Объект.СсылкаГуглДок = "" Тогда
		Возврат;
	КонецЕсли;
	ОбновитьГуглДок();
КонецПроцедуры

&НаКлиенте
Процедура ИсторияВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
КонецПроцедуры
